/*
[ API ]
프로그램들이 서로 상호작용하는 것을 도와주는 매개체


[ 스토리지 API ]
브라우저 측에서 브라우저에 데이터를 저장하기 위한 용도의 저장소
- Local Storage
- Session Storage
- IndexedDB
- Web SQL
- Cookies

로컬 스토리지는 자바스크립트 코드로 clear하거나 remove하기 전까지는 삭제되지 않는다
세션 스토리지는 브라우저 세션을 기반으로만 저장을 유지한다 (브라우저가 종류되면 세션 스토리지에 저장했던 데이터는 삭제된다)

로컬 스토리지와 세션 스토리지에 데이터를 저장할 때에는 반드시 문자열로 저장해야 한다


[ 히스토리 API ]
브라우저에서 사용자가 사이트에서 페이지를 이동한 내용을 기록하고 있는 API
SPA에서 화면 전환이 필요할 때 사용한다


[ Clipboard API ]
모바일 앱 개발에서 많이 쓰이며 사용자가 모바일 상태에서 텍스트를 캡쳐링할 때 사용하는 API


[ Canvas API ]
광범위한 2D 그래픽을 다루는 그래픽 시스템으로 픽셀 단위의 그래픽을 다룰 수 있다
*/
